[
  [
    "In a social gathering, do you feel more energized by interacting with a large group of people or by having one-on-one conversations?",
    "Large group interactions",
    "One-on-one conversations"
  ],
  [
    "How do you typically respond to being the focal point in a group setting?",
    "Embrace it and feel at ease",
    "Prefer to avoid being the center of attention"
  ],
  [
    "When meeting new people, are you more likely to initiate conversations and introductions or wait for others to approach you?",
    "Initiate conversations and introductions",
    "Wait for others to approach you"
  ],
  [
    "When faced with a problem, do you prefer to rely on concrete facts and details or explore possibilities and potential meanings?",
    "Rely on concrete facts and details",
    "Explore possibilities and potential meanings"
  ],
  [
    "In a conversation, are you more focused on the present and current details or on future possibilities and patterns?",
    "Present and current details",
    "Future possibilities and patterns"
  ],
  [
    "When recalling a memory, do you focus more on specific details or the overall impression on you?",
    "Specific details ",
    "Overall impression on me"
  ],
  [
    "When faced with a problem, do you rely more on your head and reason or your heart and empathy?",
    "Head and reason",
    "Heart and empathy"
  ],
  [
    "In a group decision-making process, do you look for the most logical and rational choice or the one that avoids conflict and makes everyone happy?",
    "Logical and rational choice ",
    "Avoids conflict and makes everyone happy "
  ],
  [
    "When making decisions, what holds the most weight for you?",
    "Objective data and analysis",
    "Personal values and the impact on people’s emotions"
  ],
  [
    "How do you feel about making plans and sticking to a schedule?",
    "Enjoy making plans and prefer a structured schedule ",
    "Prefer flexibility and spontaneity, dislike strict schedules"
  ],
  [
    "What do you do when your plans suddenly change?",
    "Dislike unexpected changes and prefer to stick to the original plan",
    "Adapt well to unexpected changes and enjoy the flexibility "
  ],
  [
    "When doing research, do you like to reach a conclusion and move on or prefer to gather more information?",
    "Like to reach a conclusion and move on",
    "Prefer to keep options open and gather more information"
  ]
]