{
    "START": {
        "q": "Hi, I'm H2OBot. I'm a simple teen help bot. You can interact with me by pressing one of the buttons at the bottom of this page. Want to do anything?",
        "a": [
            {
                "o": "Let's chat.",
                "r": "Alright then, let's begin.",
                "n": "chat-begin"
            },
            {
                "o": "What is this?",
                "r": "I'm H2OBot, a computerized help system for teens. I'm not a replacement for real professionals, but my job is to help people find the help they need. I'll listen and give advice and resources, 100% human verified, no AI-generated text involved.",
                "n": "start-explain"
            }
        ]
    },
    "start-explain": {
        "q": "Want to know more?",
        "a": [
            {
                "o": "Let's chat",
                "r": "Alright then, let's begin.",
                "n": "chat-begin"
            },
            {
                "o": "What are you?",
                "r": "I'm a computerized system that's made to help teen find the support they need. Unlike AI chatbots, everything I say has been written and verified by humans. Additionally, I can provide links and other resources to direct teens towards further help. All of this is done locally and privately on your computer, never sent to servers or strangers.",
                "n": "start-explain"
            },
            {
                "o": "What's 'H2O'?",
                "r": "Hybridized Help Online, or H2O, is a project aimed to help teens for help resources easily on the internet. I, H2OBot, am the current project being made at H2O. We're aiming to create free, accessible software that allows people to find the help they need, without AI.",
                "n": "start-explain"
            },
            {
                "o": "Can I trust you?",
                "r": "All data and input on this bot is completely confidential. Even though all our data and text is human-verified, your input is never sent outside this tab. Once the bot loads, you won't even need an internet connection, everything runs safely within your own computer, not on a server thousands of miles away.",
                "n": "start-explain"
            }
        ]
    },
    "chat-begin": {
        "q": "How have you been feeling lately?",
        "a": [
            {
                "o": "Good",
                "r": "That's good to hear.",
                "n": "ask-school"
            },
            {
                "o": "Okay",
                "r": "I see.",
                "n": "ask-school"
            },
            {
                "o": "Bad",
                "r": "Sorry to hear that.",
                "n": "ask-school"
            }
        ]
    },
    "ask-school": {
        "q": "Has school been a major stressor of your life?",
        "a": [
            {
                "o": "Yes",
                "r": "That's a common source of stress among teens. Try and manage your school stress when you're able to, always prioritize your health.",
                "n": "ask-bullying"
            },
            {
                "o": "No",
                "r": "Avoiding feeling overwhelmed at school is important. Good job on managing your school stress.",
                "n": "ask-bullying"
            }
        ]
    },
    "ask-bullying": {
        "q": "Do you deal with bullying or harassment at school? It's not uncommon, often 'jokes' or pranks can turn into bullying in a school setting.",
        "a": [
            {
                "o": "Yes",
                "r": "That's unfortunate. However, there are many ways to deal with bullying. If you want general information about the subject, you can head over to <a href='https://www.stopbullying.gov/'>StopBullying.gov</a>, an official government website that provides helpful information. If your school has an effective counselor system, contacting your counselor can always help. You can also visit <a href='https://www.crisistextline.org/'>Crisis Text Line</a> if you are interested in being able to text a helpline.",
                "n": "ask-academic"
            },
            {
                "o": "Maybe",
                "r": "It's important to be able to recognise the signs of bullying. Sometimes, a classmate's behavior might be annoying but not quite at the level of bullying, in which case it's still a good idea to tell them to stop their annoying behavior. Here's some general information about bullying: <a href='https://www.stopbullying.gov/'>StopBullying.gov</a> This is an official US government site which can provide useful info about the subject of bullying.",
                "n": "ask-academic"
            },
            {
                "o": "No",
                "r": "That's good to hear. Bullying is common in grade schools and many students have to deal with it. If you ever feel pressured or bullied, there's always resources here.",
                "n": "ask-academic"
            }
        ]
    },
    "ask-academic": {
        "q": "Have you experienced academic stress? Grades are a common stressor in Middle or High school.",
        "a": [
            {
                "o": "Yes",
                "r": "Sorry to hear that. Remember that grades aren't everything. Colleges and similar organizations will only view high school grades, and often these organizations prioritize other factors over grades. When it comes to tips for dealing with academic stress, <a href='https://hillsidehorizon.com/blog/coping-academic-pressure-strategies-teen-mental-health/'>Hillside Horizon</a> is an informative website that can give you essential resources. If you want to specifically learn what is and isn't important for college, <a href='https://www.collegedata.com/resources/getting-in/what-do-colleges-look-for-in-students'>CollegeData.com</a> has information on that topic.",
                "n": "ask-home"
            },
            {
                "o": "Nope",
                "r": "Most teens experience some level of academic stress throughout school. If you ever feel pressured by grades or similar things, you can look at <a href='https://hillsidehorizon.com/blog/coping-academic-pressure-strategies-teen-mental-health/'>Hillside Horizon</a> for some useful info.",
                "n": "ask-home"
            }
        ]
    },
    "ask-home": {
        "q": "Do you experience stress from home?",
        "a": [
            {
                "o": "Yes",
                "r": "Your experience is shared amongst many teens. Siblings and parents can be stressful at times. If you want to know more about Family pressures, you can visit <a href='https://www.spacebetweencounselingservices.com/therapy-insight/family-expectations-family-pressure-therapy-for-teens'>Space Between Counseling Services</a> for a comprehensive read about the subject.",
                "n": "final"
            },
            {
                "o": "No",
                "r": "It's important to maintain your life at both school and home. Parents, siblings, or other factors at home can put pressure in teens' lives. If you ever need help with any of these, you can look at <a href='https://www.spacebetweencounselingservices.com/therapy-insight/family-expectations-family-pressure-therapy-for-teens'>Space Between Counseling Services</a>, a site that offers information as well as counseling opportunities.",
                "n": "final"
            }
        ]
    },
    "final": {
        "q": "That's all for now. I hope I have been able to help you in some way. Remember that there are an endless amount of online resources that anyone can use. Additionally, trusted adults at home, school, or any organization are always there to assist you if you need help. Is there anything you would like before we end this conversation?",
        "a": [
            {
                "o": "Nothing",
                "r": "Alright then. It was great talking to you.",
                "n": "END"
            },
            {
                "o": "I would like to provide feedback",
                "r": "If you want to provide feedback to Hybridized Help Online, you can submit any anonymous feedback <a href='https://forms.gle/4uxLbTrPvBC4zXu26'>here</a>. We're always happy to hear your interests!",
                "n": "END"
            }
        ]
    }
}